; domain
(define (domain manito)
    (:requirements :strips)

    (:predicates 
        (en ?bloque ?donde)
        (pos ?garra ?donde)

        (libre ?quien)
        (apilado ?bloque)
        (dismover ?garra)
        (pinned ?garra)

        (torre ?debajo ?sobre)

        (pisog ?garra ?altura)
        (pisob ?bloque ?altura)

        (ocupado ?garra)
        (desocupado ?garra)
        
        (camino ?donde ?hasta)
        (alt ?al1 ?al2))


    (:action movehorizontal
        :parameters (?garra ?donde ?hasta)
        :precondition (and
            (pos ?garra ?donde)
            (camino ?donde ?hasta)
            (dismover ?garra)
        )
        :effect (and
            (pos ?garra ?hasta)
            (not (pos ?garra ?donde))
        )
    )

    (:action moverarriba
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (pinned ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (pinned ?garra))
            (dismover ?garra)
        )
    )

     (:action moverabajo
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (dismover ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (dismover ?garra))
            (pinned ?garra)
        )
    )

    (:action tomar
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (desocupado ?garra)
            (libre ?bloque)
        )
        :effect (and
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            (libre ?donde)
            (libre ?bloque)
        )
    )

    (:action soltar 
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (pisog ?garra ?alt)
            (ocupado ?garra)
            (libre ?donde)
        )
        :effect (and
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            (not (libre ?donde))
        )
    )

    
    (:action desapilar
        :parameters (?garra ?bloque ?donde ?alt ?bloque2)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (pisob ?bloque2 ?alt)
            
            (desocupado ?garra)

            (libre ?bloque)
            (apilado ?bloque2)
            (torre ?bloque2 ?bloque)
            )
            
            :effect (and
            (not (torre ?bloque2 ?bloque))
            (not (libre ?bloque))
            (not (apilado ?bloque2))
            (libre ?bloque2)
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            )
    )

    (:action apilar
        :parameters (?garra ?bloque ?bloque2 ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque2 ?alt)
            
            (ocupado ?garra)
            (libre ?bloque2)
            )
            
            :effect (and
            (torre ?bloque2 ?bloque)
            (libre ?bloque)
            (apilado ?bloque2)
            (not (libre ?bloque2))
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            )
    )
)

; problem
(define (problem goal9)
    (:domain manito)

    (:objects
        greenb blueb
        garra
        xygarra xygreen xydisp1 xydisp2
        zgarra zgreen zdisp1 zdisp2
    )

    (:init
        (en greenb xygreen)
        (pisob greenb zgreen)
        (apilado greenb)

        (en blueb xygreen)
        (pisob blueb zgreen)
        (libre blueb)

        (torre greenb blueb)

        (pos garra xygarra)
        (pisog garra zgarra)

        (dismover garra)
        (desocupado garra)

        (libre xydisp1)
        (libre xydisp2)

        (camino xygarra xygreen)
        (camino xygreen xygarra)

        (camino xygreen xydisp1)
        (camino xydisp1 xygreen)

        (camino xygreen xydisp2)
        (camino xydisp2 xygreen)

        (camino xygarra xydisp1)
        (camino xydisp1 xygarra)

        (camino xygarra xydisp2)
        (camino xydisp2 xygarra)

        (camino xydisp1 xydisp2)
        (camino xydisp2 xydisp1)

        (alt zgarra zgreen)
        (alt zgreen zgarra)
        
        (alt zgarra zdisp1)
        (alt zdisp1 zgarra)

        (alt zgarra zdisp2)
        (alt zdisp2 zgarra)
    )

    (:goal
        (and
            (en greenb xydisp1)
            (en blueb xydisp2)
            (pisob greenb zdisp1)
            (pisob blueb zdisp2)
        )
    )
)

; plan
1. (movehorizontal garra xygarra xygreen)
   deleted: (pos garra xygarra)
   added: (pos garra xygreen)
   goals met: 0 of 4
2. (moverabajo garra zgarra zgreen)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zgreen) (pinned garra)
   goals met: 0 of 4
3. (desapilar garra blueb xygreen zgreen greenb)
   deleted: (torre greenb blueb) (libre blueb) (apilado greenb) (desocupado garra) (en blueb xygreen) (pisob blueb zgreen)
   added: (libre greenb) (ocupado garra) (en blueb garra)
   goals met: 0 of 4
4. (moverarriba garra zgreen zgarra)
   deleted: (pisog garra zgreen) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 0 of 4
5. (movehorizontal garra xygreen xydisp2)
   deleted: (pos garra xygreen)
   added: (pos garra xydisp2)
   goals met: 0 of 4
6. (moverabajo garra zgarra zdisp2)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zdisp2) (pinned garra)
   goals met: 0 of 4
7. (soltar garra blueb xydisp2 zdisp2)
   deleted: (ocupado garra) (en blueb garra) (libre xydisp2)
   added: (desocupado garra) (en blueb xydisp2) (pisob blueb zdisp2)
   goals met: 2 of 4
8. (moverarriba garra zdisp2 zgarra)
   deleted: (pisog garra zdisp2) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 2 of 4
9. (movehorizontal garra xydisp2 xygreen)
   deleted: (pos garra xydisp2)
   added: (pos garra xygreen)
   goals met: 2 of 4
10. (moverabajo garra zgarra zgreen)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zgreen) (pinned garra)
   goals met: 2 of 4
11. (tomar garra greenb xygreen zgreen)
   deleted: (desocupado garra) (en greenb xygreen) (pisob greenb zgreen)
   added: (ocupado garra) (en greenb garra) (libre xygreen)
   goals met: 2 of 4
12. (moverarriba garra zgreen zgarra)
   deleted: (pisog garra zgreen) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 2 of 4
13. (movehorizontal garra xygreen xydisp1)
   deleted: (pos garra xygreen)
   added: (pos garra xydisp1)
   goals met: 2 of 4
14. (moverabajo garra zgarra zdisp1)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zdisp1) (pinned garra)
   goals met: 2 of 4
15. (soltar garra greenb xydisp1 zdisp1)
   deleted: (ocupado garra) (en greenb garra) (libre xydisp1)
   added: (desocupado garra) (en greenb xydisp1) (pisob greenb zdisp1)
   goals met: 4 of 4
